Repository: gitter-badger/admin-docs
Catalog: docs/source/locale/*/LC_MESSAGES/installation.po
Languages: de

source: If you are installing MongoDB on a Debian system, you are advised to use the method described in the MongoDB configuration:
de: Falls Sie MongoDB unter Debian installieren, halten Sie sich bitte an die folgenden Anweisungen:

source: For convenience reasons the script ``$EFFEKTIF_HOME/mongodb.install.debian.sh`` already wraps all necessary commands to install the correct version of MongoDB using apt-get. Simply execute it from the command line by opening ``$EFFEKTIF_HOME`` and calling: ::
de: Das Skript ``$EFFEKTIF_HOME/mongodb.install.debian.sh`` enthält alle notwendigen Befehle, um die richtige Version von MongoDB über APT zu installieren. Führen Sie das Skript aus, indem Sie in das Verzeichnis ``$EFFEKTIF_HOME`` wechseln und den folgenden Befehl ausführen: ::

source: or ::
de: oder ::

source: The server will use the default configuration file ``/etc/mongodb.conf``\ . See the next subsection for more information on how to configure MongoDB for Effektif and create the required user. Be aware, the installation probably started the MongoDB server already. You will need to restart the MongoDB server when you edit the configuration.
de: Der Server greift dabei auf die Standardkonfiguration in der Datei unter ``/etc/mongodb.conf`` zurück. Der nächste Abschnitt enthält detaillierte Informationen zur Konfiguration und Nutzererstellung von MongoDB. Beachten Sie, dass MongoDB nach der Installation wahrscheinlich schon gestartet wurde. Stellen Sie sicher, dass Sie MongoDB nach Änderungen in der Konfiguration neu starten.

source: Configure MongoDB
de: MongoDB konfigurieren

source: In order to run MongoDB properly, some configuration options have to be defined. The easiest solution is to create a configuration file and link this configuration file when starting MongoDB with the option ``--config``\ .
de: Um MongoDB ordnungsgemäß auszuführen, müssen einige Konfigurationseinstellungen gesetzt werden. Der einfachste Weg die Konfiguration vorzunehmen, ist eine Konfigurationsdatei zu erstellen und diese beim Starten von MongoDB über die ``--config`` Option zu verlinken.

source: If you installed MongoDB under Windows using the method in the last section, you have already copied the predefined configuration file and adjusted the values for dbpath and logpath to your system. Then your configuration file contains already all necessary values.
de: Falls Sie MongoDB unter Windows wie oben beschrieben installiert haben, haben Sie bereits eine Konfigurationsdatei erstellt und angepasst, sodass es die richtigen Werte enthält.

source: If you installed MongoDB under Linux using apt-get, e.g. by following the instructions in the last section, there should be a respective configuration file ``/etc/mongodb.conf``\ . Edit this configuration file. The properties dbpath and logpath should be defined already. It is recommened to set the properties logpath and auth to true. Furthermore, you will need to add the entry ``setParameter=textSearchEnabled=true``\ .
de: Falls Sie MongoDB unter Linux wie oben beschrieben mit APT installiert haben, befindet sich eine Konfigurationsdatei unter ``/etc/mongodb.conf``\ . Bearbeiten Sie diese Datei. Die Parameter dbpath und logpath sollten bereits definiert sein. Wir empfehlen die Variablen „logpath“ und „auth“ auf „true“ zu setzen. Zudem sollte der folgende Eintrag erstellt werden: ``setParameter=textSearchEnabled=true``\ .

source: In any other case make sure the configuration file contains the following properties.
de: Stellen Sie im Falle einer abweichenden Installationsprozedur sicher, dass die folgenden Einträge korrekt gesetzt sind:

source: Defines the directory where the database files are stored.
de: Definiert das Verzeichnis, in dem die Daten gespeichert werden.

source: Defines the file that will contain the logging output.
de: Definiert das Logverzeichnis.

source: Indicates that new logs will be appended to an existing log file after restarting the server, if set to true.
de: Falls auf “true” gesetzt, werden nach einem Neustart von MongoDB die neuen Logeinträge falls möglich an ein bereits bestehendes Logfile angefügt.

source: set the value to ``textSearchEnabled=true``
de: Setzen Sie den Wert von ``textSearchEnabled=true``\ , umTextsuche in den gespeicherten Dokumenten zu ermöglichen

source: (optional) Turns authentication on, if set to true. It is advised to turn authentication on in case the MongoDB instance can be accessed over the network.
de: (optional) Aktiviert Authentifizierung. Dieser Parameter sollte unbedingt auf “true” gesetzt werden, falls es möglich ist, auf MongoDB über ein Netzwerk zuzugreifen. Dies hängt von Ihren Administrationseinstellungen/Firewalleinstellungen ab.

source: For more configuration options, see http://docs.mongodb.org/v2.4/reference/configuration-options/\ .
de: Weitere Konfigurationsoptionen können Sie entsprechend der folgenden Dokumentation setzen: http://docs.mongodb.org/v2.4/reference/configuration-options/\ .

source: Add a database user for Effektif
de: Einen Datenbanknutzer für Effektif hinzufügen

source: Effektif requires a MongoDB user in the admin database that has the following roles:
de: Effektif benötigt einen MongoDB-Nutzer, der in der Administrationsdatenbank die folgenden Rollen innehat:

source: This role will allow you to list all databases. This becomes necessary if you plan on using the user credentials when editing any database content with a tool like Robomongo. Furthermore, it is necessary for creating backups.
de: Diese Rolle erlaubt es, alle Datenbanken aufzuführen. Dies ist notwendig für Backups und falls ein Tool wie Robomongo für den Zugriff auf mehrere Datenbanken genutzt werden soll.

source: This role is required for backups.
de: Diese Rolle wird für Backups benötigt.

source: The user will access the databases for Effektif. Effektif will create two databases, one for the user and workflow data, and one for uploaded files. The name of the first database can be configured in the Effektif configuration file. The name of the second database is derived from the name of the first one by adding “-files”. For instance, if you define the database name “effektif”, the databases “effektif” and “effektif-files” will be created.
de: Der Nutzer greift für Effektif auf die Datenbank zu. Effektif erstellt zwei Datenbanken, eine für Nutzer- und Workflowdaten und eine Weitere für hochgeladene Dateien. Der Name der ersten Datenbank kann in der Effektif-Konfigurationsdatei konfiguriert werden. Der zweite Name ist vom ersten Namen abgeleitet, indem die Endung „-files“ ergänzt wird. Nennen Sie Ihre erste Datenbank „effektif“, so heißt die zweite Datenbank „effektif-files“.

source: In general, if you want to create a new user in MongoDB you will need to authenticate with an existing user that has the role userAdmin or userAdminAnyDatabase. There is an exception for a fresh MongoDB setup. It will allow you to create the first user from localhost without any authentication. The following examples will show you how to create a new user using the credentials of an admin user and how to do it without any credentials in case of a new MongoDB.
de: Wenn Sie einen neuen Nutzer In MongoDB erstellen wollen, müssen Sie sich mit einem Nutzer mit der Rolle userAdmin oder userAdminAnyDatabase in MongoDB anmelden. Eine Ausnahme stellt die Installation eines neuen MongoDB-Systems dar, dass Ihnen ermöglicht einen neuen Nutzer ohne vorherige Authentifizierung zu erstellen. Im Folgenden wird ein neuer MongoDB-Nutzer sowohl über einen Administratorennutzer als auch als Teil einer neuen MongoDB-Installation erstellt.

source: In order to add a new user to MongoDB, the MongoDB server has to be running.
de: Um einen MongoDB-Nutzer zu erstellen, muss MongoDB gestarted worden sein.

source: Open the command cmd and go to your MongoDB\bin directory, e.g. by executing: ``cd C:\MongoDB\bin``
de: Öffnen Sie im im Kommandozeilentool (“cmd”) dasVerzeichnis MongoDB\bin, z.B. in dem Sie das folgende Kommando ausführen: ``cd C:\MongoDB\bin``

source: If you have an admin user, create the Effektif user by executing:
de: Falls Sie einen Administratorennutzer angelegt haben, erstellen Sie den neuen Nutzer wie folgt:

source: Replace <enterAdminPasswordHere> with the password, you have defined for the admin user.
de: Ersetzen Sie <enterAdminPasswordHere> mit dem Administratorenpasswort.

source: Replace <enterEffektifPasswordHere> with the password for the new Effektif user. As you can see the user name is effektif.
de: Ersetzen Sie <enterEffektifPasswordHere> mit dem Passwort des neuen Nutzers. Der Nutzername ist effektif.

source: If you have a new MongoDB and no admin user, create the Effektif user by executing:
de: Falls Sie ein neues MongoDB System ohne Administratorennutzer aufgesetzt haben, führen Sie den folgenden Befehl aus:

source: You can verify the creation of the new Effektif user by executing:
de: Um die Erstellung des Nutzers zu verifizieren, führen Sie den folgenden Befehl aus:

source: On the command line you will see the user information including the four assigned roles.
de: Die Kommandozeile wird den Nutzer und die vier assoziierten Rollen anzeigen.

source: If you have installed MongoDB using a package manager, the binaries should be available on the path. Otherwise, open the directory with the MongoDB binary files and follow the instructions.
de: Falls Sie MongoDB über einen Paketmanager installiert haben, werden die entsprechenden Anwendungen in die Linux-Standardpfade installiert weshalb sie ohne weitere Pfadangabe überall verfügbar sind. Öffnen Sie andernfalls einfach das Verzeichnis mit den Binaries, um dort die unten aufgeführten Befehle auszuführen.

source: Once the Effektif user is created, its credentials have to be added to the Effektif configuration file to the properties ``effektif.mongodb.username`` and ``effektif.mongodb.password``\ . Section :ref:`update-effektif-configuration` explains how to update the configuration file.
de: Sobald der Effektif-Nutzer erstellt wurde, müssen die Credentials in der Effektif-Konfigurationsdatei unter der Variable ``effektif.mongodb.username`` und ``effektif.mongodb.password`` hinterlegt werden. Das Kapitel :ref:`update-effektif-configuration` beschreibt die Anpassung der Konfigurationsdatei.

source: Configuring Effektif
de: Effektif konfigurieren

source: Install the license file
de: Lizenzinstallation

source: Along with the Effektif application you have received the Effektif license file license.xml. Before you can start the Effektif system, you have to add the license file to the application. Therefore, copy the license file into the directory ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ . The Effektif system will check your license file on startup and setup the defined number of licenses.
de: Mit der Effektif-Anwendung haben Sie die Lizenzdatei license.xml erhalten. Bevor Sie das System starten können, fügen Sie die Lizenzdatei in das Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes`` ein. Effektif überprüft die Datei wenn das System startet und stellt die entsprechenden Lizenzen zur Verfügung.

source: Update the Effektif configuration file
de: Die Effektif Konfigurationsdatei aktualisieren

source: Before you can start Effektif for the first time, you need to configure some mandatory properties in the Effektif configuration file. Make sure you have copied the Effektif web application to the Tomcat’s webapps directory before continuing. The configuration file can be found here ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/effektif-onpremise.properties``\ .
de: Bevor Effektif zum ersten Mal gestartet werden kann, müssen einige Variablen in der Effektif-Konfigurationsdatei gesetzt werden.Stellen Sie sicher, dass Sie die Effektif-Webanwendung in das webapps-Verzeichnis des Tomcats kopiert haben. Die Konfigurationsdatei befindet sich nun unter ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/effektif-onpremise.properties``\ .

source: The configuration file is a property file that contains one configuration option per line and key and value are separated by a “=”. Every line that starts with a “#” is commented out and will not be considered.
de: Die Konfigurationsdatei ist ein „Property File“, welches eine Konfigurationsvariable pro Zeile als “=”-separiertes Key-Value-Paar enthält. Jede Zeile die mit einer Raute „#“ beginnt, ist auskommentiert und wird nicht berücksichtigt.

source: In general, the configuration allows to configure the base URL of the Effektif system, the mail server, the database connection and integrations with third party systems (e.g. Signavio).
de: Die Konfigurationsdatei erlaubt die Konfiguration der Basis-URL, des Mailservers, der Datenbankverbindung und der Integration von Drittsystemen, zum Beispiel von Signavio.

source: (Required) The ip address or server name (incl. the port) of the server running the Effektif Tomcat application server. E.g. http://effektif.yourdomain.com:8080\ . If the server is running on port 80, the port can be omitted.
de: (Pflichtvariable) Die IP-Adresse oder der Servername (inkl. Port) der Effektif-Webanwendung, zum Beispiel: http://effektif.yourdomain.com:8080 Falls der Server auf Port 80 läuft, kann auf die Angabe des Ports verzichtet werden.

source: (Required) The ip address or server name of the outgoing email server.
de: (Pflichtvariable) Die IP-Addresse oder der Servername des Emailservers

source: The port on which the outgoing SMTP server listens
de: Der Port des Emailservers

source: If SSL should be used ( true or false )
de: Ob SSL verwendet werden soll ( true oder false )

source: If TLS should be used ( true or false )
de: Ob TLS verwendet werden soll ( true or false )

source: The username for authentication
de: Der Nutzername zur Authentifizierung am Emailserver

source: The password for authentication
de: Das Passwort zur Authentifizierung am Emailserver

source: This email address is used as the sender when the Effektif system sends out notifications.
de: Die Sender-Emailadresse von Effektif-Benachrichtigungen und Einladungen.

source: A comma separated list of mongodb servers (hostnames). If you have MongodDB running on the same server as Tomcat, the default value of localhost is ok.
de: Eine kommagetrennte List von MongoDB-Servern (Hostnamen). Falls MongoDB auf der Maschine läuft, auf der Tomcat die Effektif-Webanwendung zur Verfügung stellt, kann der Standardwert localhost beibehalten werden.

source: The Effektif MongoDB user name. If you created the user following the instructions in this guide, the name is effektif .
de: Der Effektif MongoDB Nutzername. Falls Sie den Nutzer entsprechend der Anweisungen erstellt haben, ist der name effektif .

source: The password of the Effektif MongoDB user. This is the password you have defined during the user creation.
de: Das Passwort des MongoDB Nutzers, das bei der Erstellung des Nutzers definiert wurde.

source: The name of the database Effektif should use. The default value effektif is ok.
de: Der Name der Datenbank, die von Effektif verwendet werden soll. Der Standardwert effektif kann beibehalten werden.

source: The following properties are only relevant if your Effektif installation is connected to your Signavio installation. ::
de: Die folgenden Eigenschaften sind nur relevant, falls Effektif mit Ihrer Signavio-Installation verbunden werden soll: ::

source: See section :ref:`signavio-integration` for more information on how to set up the integration.
de: Weitere Details zur Signavio-Integration erhalten Sie im Kapitel :ref:`signavio-integration`\ .

source: Configure logging
de: Logging konfigurieren

source: The Effektif system has its own application log file ``effektif.log``\ . You need to define the directory where this log file is stored. The directory is specified in the file ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/logback.xml``\ . Open the file and update the following line: ::
de: Das Effektif-System hat mit ``effektif.log`` ein eigenes Logfile. Das Verzeichnis, in dem das Logfile gespeichert wird, kann in der folgenden Datei konfiguriert werden: ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/logback.xml``\ . Öffnen Sie die datei und passen Sie die folgende Zeile an: ::

source: The value should contain an absolute path. Make sure the user executing Tomcat has the required read / write permissions for the directory.
de: Der Wert sollte einen absoluten Pfad darstellen. Stellen Sie sicher, dass der Nutzer, der Tomcat ausführt Lese- und Schreibzugriff auf das entsprechende Verzeichnis hat.

source: On Windows it necessary to escape all "\\". An example value could like this: ``"C:\\Logs\\Effektif"``\ .
de: Unter Windows ist es notwendig, alle "\\" zu escapen, sodass sich zum Beispiel der folgende Wert ergibt: ``"C:\\Logs\\Effektif"``\ .

source: This configuration file also enables you to change the log level in this file. By default, the log level is INFO. However, in a scenario where you require official support, you will be asked to set the log level to DEBUG. In order to so, update the following: ::
de: In der Konfigurationsdatei können Sie zudem das Loglevel festlegen. Standardmäßig ist das Loglevel INFO. Falls Sie zum Beispiel beim Troubleshooting Support benötigen, ist es sinnvoll, das Loglevel auf DEBUG zu erhöhen. Hierfür muss die folgende Zeile angepasst werden: ::

source: Change it to: ::
de: Der geänderte Eintrag sollte wie folgt aussehen: ::

source: You will need to restart the Tomcat server for the changes to take effect. You can find more detailed information on how to start the Tomcat server in the next section.
de: Sie müssen Ihren Tomcat neustarten, damit die Änderunge aktiv werden. Der nächste Abschnitt gibt Ihnen detailliertere Hinweise, wie sie den Tomcat server starten können.

source: The log file is configured to do a roll over. Every day, a new log file is created which contains a timestamp in the filename similar to ``effektif-2014-10-09.log``\ . The most recent log entries can still be found in the file effektif.log. After 30 days, the log files will be removed automatically.
de: Die Logdatei ist für einen „Roll Over“ konfiguriert. Dies bedeutet, das jeden Tag ein neues Logfile mit einem entsprechenden Zeitstempel erstellt wird, zum Beispiel: ``effektif-2014-10-09.log``\ . Die neuesten Einträge können zudem in der Datei effektif.log eingesehen werden. Logfiles, die älter als 30 Tage sind, werden automatisch gelöscht.

source: *Important: MongoDB version 2.6.x is not yet officially supported by Effektif. Please, make sure to install version 2.4.x.*
de: *Wichtig: MongoDB, 2.6.x wird von Effektif momentan offiziell nicht unterstüzt. Stellen Sie daher sicher, dass Sie MongoDB version 2.4.x installieren.*

source: *Important: If the server is running on any other port than port 80, your users will have to enter the port in the address line of the web browser, e.g. http://effektif.yourdomain.com:8080/\ .*
de: *Wichtig: Falls der Webserver auf einen anderen Port als Port 80 läuft, muss der Port in der Adressleiste des Browsers referenziert werden, zum Beispiel wie in: http://effektif.yourdomain.com:8080/*

source: The Effektif webapp which can be found in the directory ``$EFFEKTIF_HOME/effektif/ROOT`` needs to be copied to the Tomcat’s webapps folder. Therefore remove any files and folders that are located in ``$TOMCAT_HOME/webapps`` and copy the ROOT folder to ``$TOMCAT_HOME/webapps/``\ .
de: Die Effektif Webanwendung, die sich im Ordner ``$EFFEKTIF_HOME/effektif/ROOT`` befindet, muss in den „webapps“-Ordner des Tomcats kopiert werden. Entfernen Sie daher alle Dateien aus dem Verzeichnis ``$TOMCAT_HOME/webapps`` kopieren Sie den Ordner „ROOT“ nach ``$TOMCAT_HOME/webapps/``\ .

source: You can now start MongoDB by executing the following command: ``net start MongoDB``
de: Mit dem folgenden Befehl können Sie MongoDB nun direkt ausführen: ``net start MongoDB``

source: This will add the MongoDB repositories to your package sources and install the version 2.4.x of MongoDB. You can now simply start and stop the MongoDB server by calling ::
de: Hierdurch werden die MongoDB Repositories zu Ihren Package Sources hinzugefügt und Version 2.4.x von MongoDB installiert. Nun können Sie MongoDB mit den folgenden Befehlen stoppen und starten: ::

source: The Java backend of the Effektif system is executed using Apache Tomcat 7. Effektif does not support any older or younger versions of Tomcat than version 7. Furthermore, you have to use a 64 Bit version of Apache Tomcat 7.
de: Das Java Back End von Effektif wird im Apache Tomcat 7 Webserver ausgeführt. Ältere oder neuere Tomcat-Versionen als Version 7 werden nicht unterstützt. Weiterhin ist es erforderlich, dass Sie eine 64 Bit Version von Apache Tomcat 7 verwenden.

source: Backup and restore
de: Backup und Wiederherstellung

source: You are advised to do regular backups of the MongoDB database to prevent a complete data loss in case of a system failure. The Effektif system will NOT backup the user data on its own. Section :ref:`backup` explains in details how to set up backups for MongoDB properly. Furthermore, section :ref:`restore` explains how you can restore an older version of the user data using one of the backups.
de: Es wird Ihnen angeraten regelmäßige Backups der MongoDB Datenbank anzulegen um einen kompletten Datenverlust im Falle es Systemfehlers zu vermeiden. Das Effektif System legt allein KEINE Backups der Nutzerdaten an. Kapitel :ref:`backup` beschreibt detailliert wie Sie Backups mit MongoDB anlegen können. In Kapitel :ref:`restore` wird Ihnen zusätzlich erklärt, wie Sie Backups verwenden um ältere Versionen der Nutzerdaten wieder herzustellen.

source: *Important: In general, it is possible to install Effektif on other Linux distributions. However, the installation process can differ from the following instructions and the Effektif team cannot offer official support in case of an installation problem.*
de: *Wichtig: Es stellt in der Regel kein Problem dar, Effektif auf anderen Linux-Distributionen als Debian auszuführen. Der Installationsvorgang kann jedoch von den unten stehenden Anweisungen abweichen und das Effektif Team kann im Falle eines Installationsproblems keinen offiziellen Support bereitstellen.*
