Repository: gitter-badger/admin-docs
Catalog: docs/source/locale/*/LC_MESSAGES/installation.po
Languages: de

source: This section will guide you through the setup of Effektif. Simply follow the subsections step by step.
de: Dieses Kapitel behandelt die Installation von Effektif. Folgen Sie den detaillierten Beschreibungen und Anweisungen einfach Schritt für Schritt.

source: System requirements
de: Systemanforderungen

source: Operating system
de: Betriebssystem

source: The Effektif system can be deployed on different operating systems. Officially supported are the following operating systems:
de: Effektif kann auf verschiedenen Betriebssystemen bereitgestellt werden. Offiziell werden die folgenden Betriebssysteme unterstützt:

source: You are advised to use a 64Bit operating system in order to be able to assign more than 1.5GB of heap space to the Java VM. Furthermore, MongoDB is limited to 2GB of content on 32Bit operating systems.
de: Bitte verwenden Sie ein 64Bit Betriebssystem, damit der Java VM mehr als 1.5GB Heap Space zugewiesen werden können. Zudem ist die Speicherkapazität von MongoDB auf 32Bit Systemen auf 2GB begrenzt.

source: Hardware requirements
de: Hardwareanforderungen

source: The described installation in this adminstration guide will setup the database and the application server on the same system. However, it is also possible to setup the database and application server on separate systems. For instance, if you have already an infrastructure that provides MongoDB instances for different applications, you can simply reuse your infrastructure and just create another database for Effektif.
de: In den vorliegenden Installationsanweisungen werden Datenbank und Webanwendung auf der selben Maschine aufgesetzt. Es ist jedoch möglich, Webanwendung und Datenbank auf verschiedenen Systemen zu installieren, zum Beispiel, falls Sie über eine Maschine MongoDB Datenbanken für verschiedene Anwendungen bereitstellen und dort auch eine Datenbank für Effektif erstellen möchten.

source: The minimal hardware requirements for the combined system of application and database server are:
de: Die minimalen Hardwareanforderungen für Webanwendung und Datenbank zusammen sind wie folgt:

source: 4 core CPU
de: 4-Kern CPU

source: 50 GB disk space
de: 50 GB Festplattenspeicherplatz

source: The required disk space depends on how you will use Effektif. 50 GB should be sufficient disk space for most scenarios. However, if you plan on using a lot of file uploads in your processes the required disk space depends largely on the number and size of the uploaded files. Be aware, the required disk space does not include the space necessary for backups. If you plan on storing the backups on the same server, you should add more.
de: Der notwendige Festplattenspeicherplatz hängt stark vom Anwendungsszenario ab. 50GB reichen in aller Regel aus. Falls Sie jedoch vorhaben, viele und umfangreiche Dateien im Kontext der Prozessausführung hochzuladen, kann es selbstverständlich vorkommen, dass die notwendige Festplattenkapazität 50GB überschreitet. Berücksichtigen Sie zudem Backup-Kapazität, insbesondere wenn Sie ein Backup auf dem selben Server speichern möchten.

source: Other systems
de: Weitere Systeme

source: The Effektif system relies on a SMTP mail server to send notifications and invite users. You can simply reuse any existing mail server in your organization that supports access via SMTP.
de: Effektif benötigt eine Verbindung zu einem SMTP Emailserver, um Benachrichtigungen und Einlandungen an Nutzer zu versenden. In der Regel können Sie einen bereits existierenden Mailserver Ihrer Organisation verwenden.

source: Software requirements
de: Softwareanforderungen

source: The application server requires the following additional software:
de: Der Anwendungsserver benötigt die folgende Software:

source: The database server requires the following additional software:
de: Der Datenbankserver benötigt die folgende Software:

source: A current web browser is necessary on every client that shall display the Effektif user interface. The following list shows the supported web browsers and versions:
de: Ein relative aktueller Webbrowser auf den Nutzer-PCs ist notwendig, um Effektif aufrufen zu können. Die folgenden Browser werden unterstützt:

source: Google Chrome 23 or newer
de: Google Chrome 23 der neuer

source: Mozilla Firefox 10 or newer
de: Mozilla Firefox 10 oder neuer

source: Microsoft Internet Explorer 9 or newer
de: Microsoft Internet Explorer 9 oder neuer

source: Apple Safari 5 or newer
de: Apple Safari 5 oder neuer

source: Unpack Effektif
de: Effektif entpacken

source: Unzip the effektif-{version}.zip to a directory of your choice, e.g. ``/yourlocation/effektif-{version}`` In the rest of this guide, we'll refer to the effektif home directory as ``$EFFEKTIF_HOME``\ . The directory will contain the following files:
de: Entpacken Sie das Archiv effektif-{version}.zip in einem Verzeichnis Ihrer Wahl, zum Beispiel: ``/yourlocation/effektif-{version}`` Dieses Verzeichnis wird im weiteren Text als ``$EFFEKTIF_HOME`` bezeichnet. Das Verzeichnis enthält die folgenden Dateien:

source: \*.sh - Linux shell scripts
de: \*.sh - Linux Shellskripte

source: db - directory that contains MongoDB configuration files
de: db – Verzeichnis, das die MongoDB Konfigurationsdateien enthält

source: mongodb.conf - configuration file for Linux
de: mongodb.conf – Konfigurationsdateien für Linux

source: mongod.cfg - configuration file for Windows
de: mongod.cfg - Konfigurationsdateien für Windows

source: effektif - directory
de: effektif - Verzeichnis

source: ROOT - this directory contains the web application
de: ROOT - Verzeichnis, das die Webanwendung enthält

source: Install Java
de: Java installieren

source: The application server requires a Java runtime environment in order to execute the Java backend of Effektif. Therefore, you have to install Java 7 64Bit on the application server. You can download a respective installation package for your operating system here:
de: Der Anwendungsserver benötigt eine Java Ausführungsumgebung, um das Java-Back End von Effektif auszuführen. Installieren Sie daher Java 7 64Bit für Ihr Betriebssystem. Die entsprechenden Dateien erhalten Sie hier:

source: Install Tomcat
de: Tomcat installieren

source: You can download the latest installation files for different operating systems from the following site:
de: Die Tomcat-Installationsdateien erhalten Sie für verschiedene Betriebssysteme hier:

source: In general, please make sure the user executing the Tomcat has read / write permissions for the folder ``$TOMCAT_HOME/webapps`` and the containing subfolders.
de: Stellen Sie bitte sicher, dass Tomcat Lese- und Schreibrechte im Verzeichnis ``$TOMCAT_HOME/webapps`` und den enthaltenen Ordnern hat.

source: If you are using a Windows system, the download site offers a Windows Service Installer (“32-bit/64-bit Windows Service Installer”). This installer will install the Apache Tomcat as a Windows service which can be started, stopped and configured over a graphical user interface. The service installer is the recommended way for Windows users to install the Tomcat server. Please, make sure you execute the installer with administrator privileges.
de: Für Windows lässt sich auf der Tomcat-Seite ein Windows Service Installer (“32-bit/64-bit Windows Service Installer”) herunterladen. Dieser Installer richtet Apache Tomcat als Windows Service ein, der über eine Desktopanwendung gestartet, gestoppt und weitgehend konfiguriert werden kann. Führen Sie den Installer mit Administratorrechten aus.

source: Furthermore, it is recommended to install the Apache Tomcat into a root folder on ``C:\``\ .
de: Es wird empfohlen, Apache Tomcat in einem root-Ordner unter ``C:\`` zu installieren.

source: Configure Tomcat
de: Tomcat konfigurieren

source: This section will point the configuration options that are required to run Effektif. However, Tomcat offers more configuration options that can be found in the official documentation:
de: Dieser Abschnitt beschreibt die Konfigurationseinstellungen, die notwendig sind, um Effektif auszuführen. Weitere Einstellungen, die Sie eventuell vornehmen möchten, finden Sie hier:

source: Java options
de: Java-Optionen

source: There are some Java options that need to be configured before starting the Tomcat server. These options are configured using the ``JAVA_OPTS`` environment variable. It should contain the following values:
de: Die folgenden Java-Optionen müssen über die ``JAVA_OPTS`` Umgebungsvariable gesetzt werden, bevor Tomcat gestartet wird:

source: minimum RAM, should be at least 1.5GB
de: minimaler RAM, sollte mindestens 1.5GB betragen

source: maximum RAM, should be at least 2GB but more is recommended
de: maximaler RAM, sollte mindestens 2GB betragen, mehr ist jedoch empfehlenswert

source: sets UTF-8 as Apache Tomcats default encoding mechanism
de: setzt UTF-8 als den Standard-Encodingsmechanismus des Apache Tomcats

source: initial permanent generation space in MB
de: initialer “Permantent Generation Space” in MB

source: maximum permanent generation space in MB
de: maximaler “Permantent Generation Space” in MB

source: In order to allocate sufficient RAM to the Tomcat server you have to set the options Xms and Xmx followed by the number of MB allocated and a literal ‘m’. ``Xms`` defines the initial / minimum amount of RAM that is used and ``Xmx`` the allowed maximum. You are advised to allocate at least 2GB of RAM to the Tomcat. However, it is recommended to use more RAM. For example, if you want to assign 4GB of maximum RAM the option would be ``-Xmx4096m``\ .
de: Um ausreichend RAM für Tomcat zur Verfügung zu stellen, müssen die Xms und Xmx-Optionen gesetzt werden, gefolgt von der MB-Anzahl und dem Buchstaben “m”. ``Xms`` definiert den minimalen RAM, ``Xmx`` den maximalen RAM. Es sollten mindestens 2GB RAM zugewiesen werden, mehr ist jedoch empfehlenswert. Wenn Sie z.B. 4GB maximalen RAM zuweisen möchten, würde die Option wie folgt aussehen: ``-Xmx4096m``

source: The values for the permanent generation space have to be increased as well, these are defined by the values ``-XX:PermSize=128m`` and ``-XX:MaxPermSize=256m``\ .
de: Zudem müssen die Werte für den “Permantent Generation Space” erhöht werden. Hierfür sind die Variablen ``-XX:PermSize=128m`` und ``-XX:MaxPermSize=256m`` zu setzen.

source: If you installed Tomcat using the Windows service installer, you can open the configuration dialog by opening the Windows start menu and selecting ``Program Files\Apache Tomcat\Configure Tomcat``\ .
de: Falls Sie Tomcat über den Windows Installer installiert haben, öffen Sie nun den Konfigurationsdialog über das ``Startmenü und Programme\Apache Tomcat\Configure Tomcat``\ .

source: The tab Java offers the possibility to set the options and define the memory pool (minimum and maximum RAM usage). Fill in the values for Xms and Xmx into the fields for memory pool and add the other options to the text area labeled as Java Options.
de: Das "Java-Tab" ermöglicht es nun, die entsprechenden Optionen zu setzen. Minimaler und maximaler RAM-Zuweisung werden unter “Initial memory pool” und “Maximum memory pool” definiert. Fügen Sie die verbleibenden Option in das Textfeld "Java Options" ein.

source: In order to run Effektif on your server, you will need to install some additional software. Depending on your deployment strategy (combined or separate system for application and database), you have to install the following software requirements either on the same server or the respective separate servers.
de: Um Effektif auf Ihrem Server ausführen zu können, ist es notwendig weitere Software zu installieren (beziehungsweise installiert zu haben). Abhängig von Ihrem Installationsvorhaben ist es notwendig die unten aufgeführte Software auf dem Server, beziehungsweise den Servern, zu installieren.

source: The following sections contain detailed instructions on how to install and configure the additional software components.
de: Die nachfolgenden Kapitel enthalten detaillierte Installations- und Konfigurationsanweisungen für die zusätzliche Software.

source: On Linux systems you need to make the scripts executable with the ``chmod`` command like this: ::
de: Auf Linuxsystemen ist es notwendig, die Shellskripte ausführbar zu machen. Verwenden Sie hierfür den ``chmod``\ -Befehl, wie zum Beispiel: ::

source: If you are using Linux, you might consider installing Apache Tomcat using a packet manager. In case of Debian, you can use the Advanced Packaging Tool (APT) and execute the following command: ::
de: Unter Linux ist es empfehlenswert, Apache Tomcat über den Paketmanager zu installieren. Unter Debian bietet sich das Advanced Packaging Tool (APT) an: ::

source: The Java tab of the Tomcat configuration dialog
de: Das Java-Tab in Tomcats Konfigurationsdialog

source: One way to define the ``JAVA_OPTS`` under Debian and other Linux distributions is to create the file ``setenv.sh`` in the Tomcat 7 ``/bin/`` directory. This directory contains also other files like the ``catalina.sh``\ , the ``startup.sh`` or the ``shutdown.sh`` und is for instance located in ``/usr/share/tomcat7`` or a similar directory. Simply create or extend any existing setenv.sh file and add the line for ``the JAVA_OPTS``\ : ::
de: Unter Debian und anderen Linux-Distributionen können die JAVA_OPTS gesetzt werden, indem Sie die Datei setenv.sh im Verzeichnis Tomcat 7 /bin/ erstellen. In diesem Verzeichnis befinden sich zudem Datein wie catalina.sh, startup.sh und shutdown.sh der Pfad ist zum Beispiel /usr/share/tomcat7 oder vergleichbar.Erstellen Sie einfach die Datei setenv.sh (oder öffen Sie die bestehende Datei) und fügen Sie eine Zeile für die JAVA_OPTS hinzu:

source: In case you have created a new ``setenv.sh`` file, you have to make sure it is executable using the ``chmod`` command: ::
de: Wenn Sie eine neue ``setenv.sh``-Datei erstellt haben, müssen Sie diese noch ausführbar machen. Verwenden Sie hierfür den ``chmod``\-Befehl: ::

source: Setup the Tomcat connector
de: Erstellen des Tomcat Connectors

source: By default the Tomcat server will start up using port 8080 and 8005. Port 8080 is used for serving the Effektif web application. Port 8005 is used to shutdown the Tomcat instance. You can change the port in the server.xml which is located in ``$TOMCAT_HOME/conf/server.xml``\ .
de: Tomcat läuft standardmäßig auf den Ports 8080 und 8005, wobei Port 8080 die Effektif Webanwendung bereitstellt und Port 8005 zum Herunterfahren der Tomcat-Instanz verwendet wird. Die Ports können in der Datei server.xml geändert werden, die im Verzeichnis ``$TOMCAT_HOME/conf/server.xml`` zu finden ist.

source: Locate the HTTP connector and change the value of port to your preferred port. Furthmore, make sure the connector contains the entry ``URIEnconding=”UTF-8”``\ . For example, the connector could look like this:
de: Machen Sie den HTTP Connector in der server.xml-Datei ausfindig und passen Sie den Wert für den Port nach Ihren Belieben an. Stellen Sie zudem sicher, dass der Connector den Eintrag ``URIEnconding=”UTF-8“``\ . Der Connector könnte z.B. so aussehen:

source: Copy the Effektif webapp
de: Kopieren der Effektif Webanwendung

source: The Effektif application needs to run as the ROOT application in the Tomcat. Therefore, running it in parallel with another application that requires to run as the ROOT application in the same Tomcat is currently not possible.
de: Effektif muss als ROOT-Anwendung im Tomcat ausgeführt werden. Daher ist es momentan nicht möglich, eine andere Anwendung, die ebenfalls als ROOT-Anwendung ausgeführt werden muss, im selben Tomcat auszuführen.

source: Install MongoDB
de: MongoDB installieren

source: MongoDB is the only database system currently supported by Effektif. In case, you have already an infrastructure that can provide a MongoDB version 2.4.x instance, simply create a new instance for Effektif and skip to the section :ref:`configure-mongodb`. Otherwise go on with the installation instructions.
de: MongoDB ist das einizge Datenbanksystem, das momentan von Effektif unterstützt wird. Falls Sie bereits ein MongoDB 2.4.x System zur Verfügung stehen haben, können Sie einfach eine neue Instanz für Effektif erstellen und zum Abschnitt :ref:`configure-mongodb` springen. Folgen Sie andernfalls den folgenden Anweisungen.

source: General information about installing MongoDB on different operating systems can be found on:
de: Allgemeine Informationen zur Installation von MongoDB 2.4.x erhalten Sie hier:

source: In case you are using Linux, you have the possibilities to install MongoDB using either a package manager like apt-get or downloading the binaries directly. It is recommened to use the package manager because it will also setup respective scripts that allow you to start and stop the server easily. However, you have to make sure the correct version is installed. Subsection :ref:`install-mongodb-debian` explains in more details how to setup MongoDB on Debian and might work as an example for other Linux distributions.
de: Falls Sie Linux verwenden, können Sie entweder einen Paketmanager wie APT zum Download von MongoDB verwenden oder die Binary-Dateien direkt herunterladen. Wir empfehlen den Download über einen Paketmanager, da hiermit zudem Skripts zum Starten und Stoppen der Anwendung automatisch heruntergeladen und konfiguriert werden. Stellen Sie jedoch sicher, dass Sie die korrekte Version von MongoDB installiert haben.Der Abschnitt :ref:`install-mongodb-debian` erklärt genauer wie MongoDB unter Debian installiert werden kann und kann als Beispiel für andere Linux-Distributionen dienen.

source: Remarks for downloading the binaries
de: Anmerkungen zum Download der Binary-Dateien

source: Effektif does not yet support MongoDB 2.6.x. Therefore, you have to download the latest MongoDB 2.4.x release, which will be listed under previous releases. You can find the respective version for your operating system here:
de: Effektif unterstützt noch nicht MongoDB 2.6.x. Laden Sie daher das neueste MongoDB 2.4.x Release herunter. Dieses finden Sie unter „previous releases“ auf der MongoDB Downloadseite:

source: Please, make sure to download the 64Bit version of MongoDB. The 32Bit version has a limited size of 2GB for stored content and, therefore, cannot be used in productive systems.
de: Stellen Sie sicher, dass Sie die 64Bit Version von MongoDB herunterladen. In der 32Bit-Version ist die Speicherkapazität auf 2GB begrenzt, sodass eine Verwendung für Produktivsysteme nicht sinnvoll ist.

source: Windows requires you to download the binaries. Consider the remarks of the last subsection when doing so. If you are using any version older than Windows Server 2008 R2, you have to download the 64Bit legacy release.
de: Unter Windows ist es notwendig, die Binary-Dateien herunterzuladen. Berücksichtigen Sie die oben stehenden Anmerkungen zur Releaseversion (2.4.x) und Bit Version (64Bit). Falls Sie eine ältere Windows-Version als Windows Server 2008 R2 verwenden, laden Sie das 64Bit Legacy Release herunter.

source: You can find more details about installing MongoDB on Windows in the documentation:
de: Weitere Details zur Installation von MongoDB unter Windows finden Sie hier in der MongoDB Dokumenation:

source: When you finished downloading MongoDB follow the next steps:
de: Folgen Sie diesen Schritten, nachdem Sie MongoDB heruntergeladen haben:

source: Extract the content of the downloaded archive into ``C:\MongoDB`` or any directory of your choice.
de: Entpacken Sie den Inhalt des heruntergeladenen Archivs in ``C:\MongoDB`` oder einem anderen Verzeichnis Ihrer Wahl.

source: The MongoDB directory should contain directly the extracted bin directory.
de: Das MongoDB Verzeichnis sollte dabei direkt das entpackte bin-Verzeichnis enthalten.

source: Important: The whole path shouldn’t contain any whitespaces. Otherwise the service configuration will not work.
de: Wichtig: Der gesamte Pfad sollte keine Leerzeichen enthalten. Ansonsten wird die Servicekonfiguration nicht funktionieren.

source: Create a data directory for the MongoDB files, e.g. ``C:\MongoDB\data``\ .
de: Erstellen Sie ein Datenverzeichnis für die MongoDB-Dateien, zum Beispiel: ``C:\MongoDB\data``\ .

source: This directory will need the most disk space. Make sure the drive has sufficient disk space.
de: Dieses Verzeichnis wird einen Großteil des benötigten Festplattenspeichers verwenden. Stellen Sie daher sicher, dass das Laufwerk genügend Speicehrplatz zur Verfügung stellt.

source: Create a logs directory for the MongoDB log files, e.g. ``C:\MongoDB\logs``\ .
de: Erstellen Sie ein Verzeichnis für die MongoDB Log-Dateien, zum Beispiel ``C:\MongoDB\logs``\ .

source: Copy the file ``$EFFEKTIF_HOME\db\mongod.cfg`` to your MongoDB directory ``C:\MongoDB\mongod.cfg`` and edit the file.
de: Kopieren Sie die Konfigurationsdatei aus ``$EFFEKTIF_HOME\db\mongod.cfg`` in das MongoDB-Verzeichnis ``C:\MongoDB\mongod.cfg`` und bearbeiten Sie die Datei.

source: The dbpath needs to contain the absolute path to the data directory, e.g. ``C:\MongoDB\data``\ .
de: Die Variable dbpath muss den absoluten Pfad zum Datenverzeichnis enthalten, zum Beispiel ``C:\MongoDB\data``\ .

source: The logpath needs to contain the absolute path to the log file, e.g. ``C:\MongoDB\logs\mongodb.log``\ . The log file will be created once MongoDB is started.
de: Die Variable logpath muss den absoluten Pfad zum Logverzeichnis enthalten, zum Beispiel ``C:\MongoDB\logs\mongodb.log``\ . Die Logdatei wird beim Starten von MongoDB erstellt (beziehungsweise, falls vorhanden, ergänzt).

source: See section :ref:`configure-mongodb` for more information about the other configuration values.
de: Im Abschnitt :ref:`configure-mongodb` werden weitere Konfigurationsoptionen beschrieben.

source: Open the command line cmd with administrative privileges and execute the following command. Make sure to use absolute paths and replace them with the matching ones on your system.
de: Öffnen Sie das Windows Kommandozeilentool („cmd“) mit Administratorenrechten und führen Sie das folgende Kommando aus. Stellen Sie dabei sicher, dass die Pfade den von Ihnen konfigurierten absoluten Pfaden entsprechen.

source: The command line should tell you that the service MongoDB was properly created.
de: Das Kommandozeilentool sollte Ihnen bestätigen, dass der MongoDB Service erfolgreich registriert wurde.

source: You can unregister the service again by executing: ``C:\MongoDB\bin\mongod.exe --remove``
de: Mit dem folgenden Befehl können Sie den Service wieder entfernen: ``C:\MongoDB\bin\mongod.exe --remove``

source: The registered service should start MongoDB automatically on startup of Windows.
de: Der Service wird MongoDB nach dem Starten von Windows automatisch ausführen.

source: If this command fails with the error 1053 or 2186, make sure that the configuration file contains absolute paths. Furthermore, the paths must not have any whitespaces and should not be located in any directory that requires admin privileges.
de: Falls der Befehl mit dem Error 1053 oder 2186 fehlschlägt, überprüfen Sie bitte, ob die Konfigurationsdatei tatsächlich die korrekten absoluten Pfade enthält und ob die Pfade keine Leerzeichen enthalten. Korrigieren Sie gegebenenfalls die Konfiguration.

source: You can stop MongoDB by calling: ``net stop MongoDB``
de: Der folgende Befehl stoppt MongoDB: ``net stop MongoDB``

source: The service is also listed in the services window that can be opened by running ``services.msc``\ .
de: Der MongoDB Service ist nun auch unter der Serviceverwaltung gelistet, die über ``services.msc`` aufgerufen werden kann.
